Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 75, 100)           4000000   
_________________________________________________________________
bidirectional (Bidirectional (None, 75, 100)           160800    
_________________________________________________________________
dropout (Dropout)            (None, 75, 100)           0         
_________________________________________________________________
bidirectional_1 (Bidirection (None, 75, 10)            8880      
_________________________________________________________________
dropout_1 (Dropout)          (None, 75, 10)            0         
_________________________________________________________________
crf_layer (CRF)              (None, 75)                230       
=================================================================
Total params: 4,169,910
Trainable params: 169,910
Non-trainable params: 4,000,000
_________________________________________________________________
