Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 75, 100)           4000000   
_________________________________________________________________
bidirectional (Bidirectional (None, 75, 10)            8880      
_________________________________________________________________
dropout (Dropout)            (None, 75, 10)            0         
_________________________________________________________________
crf_layer (CRF)              (None, 75)                230       
=================================================================
Total params: 4,009,110
Trainable params: 9,110
Non-trainable params: 4,000,000
_________________________________________________________________
