Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 75, 100)           4000000   
_________________________________________________________________
bidirectional (Bidirectional (None, 75, 10)            8880      
_________________________________________________________________
dropout (Dropout)            (None, 75, 10)            0         
_________________________________________________________________
bidirectional_1 (Bidirection (None, 75, 10)            1680      
_________________________________________________________________
dropout_1 (Dropout)          (None, 75, 10)            0         
_________________________________________________________________
crf_layer (CRF)              (None, 75)                230       
=================================================================
Total params: 4,010,790
Trainable params: 4,010,790
Non-trainable params: 0
_________________________________________________________________
