Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 500, 128)          640000    
_________________________________________________________________
bidirectional (Bidirectional (None, 500, 128)          98816     
_________________________________________________________________
bidirectional_1 (Bidirection (None, 64)                41216     
_________________________________________________________________
dense (Dense)                (None, 64)                4160      
=================================================================
Total params: 784,192
Trainable params: 784,192
Non-trainable params: 0
_________________________________________________________________
