Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 500, 128)          640000    
_________________________________________________________________
lstm (LSTM)                  (None, 24)                14688     
_________________________________________________________________
dense (Dense)                (None, 500)               12500     
=================================================================
Total params: 667,188
Trainable params: 667,188
Non-trainable params: 0
_________________________________________________________________
