Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 500, 128)          640000    
_________________________________________________________________
bidirectional (Bidirectional (None, 1000)              2516000   
_________________________________________________________________
dropout (Dropout)            (None, 1000)              0         
_________________________________________________________________
dense (Dense)                (None, 128)               128128    
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                4128      
=================================================================
Total params: 3,288,256
Trainable params: 3,288,256
Non-trainable params: 0
_________________________________________________________________
