Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 500, 128)          640000    
_________________________________________________________________
bidirectional (Bidirectional (None, 500, 128)          98816     
_________________________________________________________________
bidirectional_1 (Bidirection (None, 128)               98816     
_________________________________________________________________
dense (Dense)                (None, 32)                4128      
=================================================================
Total params: 841,760
Trainable params: 841,760
Non-trainable params: 0
_________________________________________________________________
