Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 200, 128)          5120000   
_________________________________________________________________
bidirectional (Bidirectional (None, 200, 256)          263168    
_________________________________________________________________
bidirectional_1 (Bidirection (None, 128)               164352    
_________________________________________________________________
dense (Dense)                (None, 64)                8256      
_________________________________________________________________
dropout (Dropout)            (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                2080      
=================================================================
Total params: 5,557,856
Trainable params: 5,557,856
Non-trainable params: 0
_________________________________________________________________
