Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 200, 128)          5120000   
_________________________________________________________________
lstm (LSTM)                  (None, 200)               263200    
_________________________________________________________________
dense (Dense)                (None, 200)               40200     
=================================================================
Total params: 5,423,400
Trainable params: 5,423,400
Non-trainable params: 0
_________________________________________________________________
