Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 10)                1720      
_________________________________________________________________
dense_4 (Dense)              (None, 10)                110       
_________________________________________________________________
activation (Activation)      (None, 10)                0         
=================================================================
Total params: 1,830
Trainable params: 1,830
Non-trainable params: 0
_________________________________________________________________
