Model: "sequential_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
simple_rnn_1 (SimpleRNN)     (None, 10)                390       
_________________________________________________________________
dense_19 (Dense)             (None, 10)                110       
_________________________________________________________________
activation_1 (Activation)    (None, 10)                0         
=================================================================
Total params: 500
Trainable params: 500
Non-trainable params: 0
_________________________________________________________________
