Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
simple_rnn (SimpleRNN)       (None, 10)                390       
_________________________________________________________________
dense_4 (Dense)              (None, 10)                110       
_________________________________________________________________
activation (Activation)      (None, 10)                0         
=================================================================
Total params: 500
Trainable params: 500
Non-trainable params: 0
_________________________________________________________________
